Tekla Open API Reference for Tekla Structures 2025
Polygon Properties
The Polygon type exposes the following members.
Properties
Name | Description
Points
 The corners of the polygon.
Top
See Also
Reference
Polygon Class
Tekla.Structures.Model Namespace